## Active View
## 4 ビューヘルパー
### ヘルパーメソッドとは？
Viewの機能。HTMLで直接書くよりシンプルに書くことができる。
- image_tag
- link_to
- form_with

[【Rails】知っておきたいヘルパーメソッド | Pikawaka](https://pikawaka.com/rails/sub_category/helper-method)

### 4.3 入力フォームを生成する基本のヘルパーメソッド
`form_with` HTMLタグに変換される。
#### modelオプション（特定のリソース）
localオプションを省略すると非同期に。
変換された内容は以下の通り
- 宛先URL(actionの内容)★
- HTTPメソッド デフォルトはPOST

action = 宛先が示すURLはボタンが押された時の送信先URL。これはルーティングに従って自動的に実装される。modelオプションを使用したときは、通常送信先を指定しない。（自動的にやってくれるから）

#### scopeオプション
特定のリソースと結びつかないフォームの場合。
自分でurlオプションで宛先URLを指定しないといけない。

### 4.4 フォーム要素を構成するヘルパーメソッド

### 4.7 独自のヘルパーの設定
### 4.8 その他のヘルパーメソッド
